In [5]:
# Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. 
# Определите какому фильму было выставлено больше всего оценок 5.0.
import pandas as pd
ratings = pd.read_csv('ratings.csv')
ratings = ratings[ratings['rating']==5.0]
ratings

       userId  movieId  rating   timestamp
21          2       17     5.0   835355681
22          2       39     5.0   835355604
29          2      150     5.0   835355395
37          2      222     5.0   835355840
44          2      265     5.0   835355697
...       ...      ...     ...         ...
99975     671     4306     5.0  1064245548
99978     671     4886     5.0  1064245488
99979     671     4896     5.0  1065111996
99982     671     4993     5.0  1064245483
99994     671     5952     5.0  1063502716

[15095 rows x 4 columns]

In [8]:
ratings.max().head()

userId       6.710000e+02
movieId      1.639490e+05
rating       5.000000e+00
timestamp    1.476623e+09
dtype: float64

In [9]:
ratings.groupby('movieId').max().head()

         userId  rating   timestamp
movieId
1           671     5.0  1469161081
2           662     5.0  1469162190
3           646     5.0  1107034474
5           113     5.0  1366831985
6           666     5.0  1417930660

In [28]:
# Задание 2

import pandas as pd
data = pd.read_csv('power.csv')
baltic = ['Latvia', 'Litva', 'Estonia']
years = [2005, 2006, 2007, 2008, 2009, 2010]
cat = [4, 12, 21]
filtered_countries = data[ (data['country'].isin(baltic)) & (data['year'].isin(years)) & (data['category'].isin(cat)) & (data['quantity'] >= 0)]

filtered_countries.head()

       country  year  quantity  category
10617  Estonia  2008       1.0         4
10618  Estonia  2007       0.0         4
10619  Estonia  2006       0.0         4
10620  Estonia  2005       1.0         4
12755  Estonia  2008       1.0         4

In [29]:
total = filtered_countries['quantity'].sum()
print('Суммарное потребление электроэнергии стран Прибалтики = ', total)

Суммарное потребление электроэнергии стран Прибалтики =  118284.0

In [34]:
type(filtered_countries)

pandas.core.frame.DataFrame

In [40]:
# Задание 3
# Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')[0]

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,3 025,"0,0%",Nasdaq,11 829,"1,0%",Биткойн,16 154,"-1,1%",USD/RUB,773425,"0,0%"
1,РТС,1 228,"-0,9%",S&P500,3 585,"1,4%",Нефть,426,"-1,5%",EUR/RUB,915805,"0,5%"
2,Dow,29 480,"1,4%",FTSE100,6 316,"-0,4%",Золото,1 890,"0,7%",EUR/USD,11834,"0,2%"

In [36]:
data_set = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')
data_set.head()

AttributeError: 'list' object has no attribute 'head'